package animal.shelter.animalsshelter.util;

import com.vdurmont.emoji.EmojiParser;

public class AdoptingDocumentsAndRules {
    public static final String MEETING_DOG_RULES = EmojiParser.parseToUnicode(Emoji.DOG_FACE + Emoji.CAT_FACE +
            "Первая встреча с будущим питомцем:\n" +
            Emoji.CHECK_MARK + " Приходите в удобной одежде, которую не жалко испортить и легко стирать,\n" +
            Emoji.CHECK_MARK + " Настраивайтесь на позитивные эмоции,\n" +
            Emoji.CHECK_MARK + " Прихватите лакомство, которое разрешит/предложит принести волонтёр,\n" +
            Emoji.CHECK_MARK + " Чётко выполняйте рекомендации и советы волонтёра, даже если вы опытный собачник,\n" +
            Emoji.CHECK_MARK + " Не делайте резких движений,\n" +
            Emoji.CHECK_MARK + " Не махайте руками и ногами,\n" +
            Emoji.CHECK_MARK + " Позвольте животному вас обнюхать, ладонь нужно подавать раскрытой на уровень носа собаки,\n" +
            Emoji.CHECK_MARK + " Животное может вас испугаться, такое случается, не волнуйтесь и не паникуйте.\n");

    public static final String MEETING_CAT_RULES = EmojiParser.parseToUnicode(Emoji.CAT_FACE +
            "Первая встреча с будущим питомцем:\n" +
            Emoji.CHECK_MARK + " Приходите в удобной одежде, которую не жалко испортить и легко стирать,\n" +
            Emoji.CHECK_MARK + " Настраивайтесь на позитивные эмоции,\n" +
            Emoji.CHECK_MARK + " Прихватите лакомство, которое разрешит/предложит принести волонтёр,\n" +
            Emoji.CHECK_MARK + " Чётко выполняйте рекомендации и советы волонтёра, даже если вы опытный кошатник,\n" +
            Emoji.CHECK_MARK + " Не делайте резких движений,\n" +
            Emoji.CHECK_MARK + " Не махайте руками и ногами,\n" +
            Emoji.CHECK_MARK + " Позвольте животному вас обнюхать, ладонь нужно раскрыть на уровень носа кота и не заигрывать пальцами,\n" +
            Emoji.CHECK_MARK + " Животное может вас испугаться, такое случается, не волнуйтесь и не паникуйте.\n");

    public static final String DOCUMENTS_FOR_ADOPTION = EmojiParser.parseToUnicode(Emoji.PAGE_FACING_UP +
            "Список необходимых документов:\n" +
            Emoji.CHECK_MARK + " Договор о передаче животного в 2х экземплярах,\n" +
            Emoji.CHECK_MARK + " Паспорт усыновителя,\n" +
            Emoji.CHECK_MARK + " Справки из ПНД и нарко-диспансера,\n" +
            Emoji.CHECK_MARK + " Письменное согласие всех проживающих вместе членов семьи,\n" +
            Emoji.CHECK_MARK + " Письменное согласие собственника или хозяина арендуемого жилья,\n" +
            Emoji.CHECK_MARK + " Ветеринарный паспорт питомца (выдаётся приютом).");
    public static final String TRAVELLING_WITH_PET = EmojiParser.parseToUnicode(Emoji.TAXI +
            "Правила транспортировки животных:\n" +
            Emoji.CHECK_MARK + " Для мелкого животного необходимо заранее приобрести переноску,\n" +
            Emoji.CHECK_MARK + " Для средних и крупных собак понадобятся ошейник, намордник и подстилка,\n" +
            Emoji.CHECK_MARK + " В общественном транспорте и в такси животные путешествуют в переноске или с поводком и в наморднике,\n" +
            Emoji.CHECK_MARK + " Поводок, рулетку, ошейник, шлейку, намордник подбирают под размер и вес собаки,\n" +
            Emoji.CHECK_MARK + " При длительном переезде необходимо позаботиться о воде и выгуле для питомца,\n" +
            Emoji.CHECK_MARK + " При путешествии в личном автомобиле перевозите животное в переноске или на поводке для безопасности всех в машине.\n");

    public static final String TRAVELLING_WITH_CAT = EmojiParser.parseToUnicode(Emoji.TAXI +
            "Правила транспортировки кошек:\n" +
            Emoji.CHECK_MARK + " Для кота или котёнка необходимо заранее приобрести переноску соответствующего размера,\n" +
            Emoji.CHECK_MARK + " В общественном транспорте и в такси животные путешествуют исключительно в переноске под присмотром хозяина,\n" +
            Emoji.CHECK_MARK + " Если решите приобретать поводок, рулетку, ошейник, шлейку подбирайте их под размер и вес питомца,\n" +
            Emoji.CHECK_MARK + " При длительном переезде необходимо позаботиться о воде и туалете для питомца,\n" +
            Emoji.CHECK_MARK + " При путешествии в личном автомобиле перевозите животное в переноске для безопасности всех в машине.\n");
    public static final String PLACE_FOR_PUPPY = EmojiParser.parseToUnicode(Emoji.DOG +
            "Как обустроить дом для щенка:\n" +
            Emoji.CHECK_MARK + " Заранее определите несколько вариантов, возможных мест для щенка,\n" +
            Emoji.CHECK_MARK + " Подготовьте подстилку, чтобы она была обозначением места для щенка,\n" +
            Emoji.CHECK_MARK + " Подготовьте миски для воды и еды по размеру питомца,\n" +
            Emoji.CHECK_MARK + " Подготовьте 1-2 игрушки для развлечения щенка,\n" +
            Emoji.CHECK_MARK + " Желательно запастись лакомствами для поощрения и занятий со щенком,\n" +
            Emoji.CHECK_MARK + " Если в доме есть другие животные, продумайте варианты их временной изоляции от щенка,\n" +
            Emoji.CHECK_MARK + " Уберите с пола и с легкодоступных поверхностей все мелкие предметы и обувь.\n");

    public static final String PLACE_FOR_KITTEN = EmojiParser.parseToUnicode(Emoji.CAT +
            "Как обустроить дом для котёнка:\n" +
            Emoji.CHECK_MARK + " Заранее определите несколько вариантов, возможных мест для котёнка,\n" +
            Emoji.CHECK_MARK + " Закройте, заблокируйте все щели и углы, куда котёнку попадать не нужно,\n" +
            Emoji.CHECK_MARK + " Подготовьте лежанку, чтобы она была обозначением места для питомца,\n" +
            Emoji.CHECK_MARK + " Желательно позаботиться о когтеточке, чтобы котёнок не портил мебель,\n" +
            Emoji.CHECK_MARK + " Продумайте и подготовьте туалет и место для него,\n" +
            Emoji.CHECK_MARK + " Подготовьте миски для воды и еды по размеру питомца,\n" +
            Emoji.CHECK_MARK + " Подготовьте 1-2 игрушки, можно что-то из них подвесить для развлечения котёнка,\n" +
            Emoji.CHECK_MARK + " Обязательно играйте с котёнком ежедневно и приучайте к ласковым поглаживаниям,\n" +
            Emoji.CHECK_MARK + " Если в доме есть другие животные, продумайте варианты их временной изоляции,\n" +
            Emoji.CHECK_MARK + " Уберите с пола и с легкодоступных (даже высоких) поверхностей все мелкие и бьющиеся предметы и обувь.\n");

    public static final String PLACE_FOR_DOG = EmojiParser.parseToUnicode(Emoji.DOG +
            "Как подготовить дом для взрослой собаки:\n" +
            Emoji.CHECK_MARK + " Заранее определите все возможные варианты мест для собаки,\n" +
            Emoji.CHECK_MARK + " Подготовьте подстилку (если считаете нужным), чтобы она была обозначением места собаки,\n" +
            Emoji.CHECK_MARK + " Подготовьте миски для воды и еды по размеру питомца (можно на стойке),\n" +
            Emoji.CHECK_MARK + " Подготовьте 1-2 резиновые игрушки для развлечения собаки,\n" +
            Emoji.CHECK_MARK + " Желательно приобрести лакомства для поощрения и тренировок с собакой,\n" +
            Emoji.CHECK_MARK + " Если в доме есть другие животные, продумайте варианты их временной изоляции от собаки,\n" +
            Emoji.CHECK_MARK + " Уберите с пола и с легкодоступных поверхностей все мелкие предметы и обувь.\n");

    public static final String PLACE_FOR_CAT = EmojiParser.parseToUnicode(Emoji.CAT +
            "Как обустроить дом для взрослых котов:\n" +
            Emoji.CHECK_MARK + " Заранее определите несколько вариантов, возможных мест для кота,\n" +
            Emoji.CHECK_MARK + " Закройте, заблокируйте все щели и углы, куда коту попадать не нужно,\n" +
            Emoji.CHECK_MARK + " Подготовьте лежанку, чтобы она была обозначением места для питомца,\n" +
            Emoji.CHECK_MARK + " Желательно позаботиться о когтеточке, чтобы кот не портил мебель,\n" +
            Emoji.CHECK_MARK + " Продумайте и подготовьте туалет и место для него,\n" +
            Emoji.CHECK_MARK + " Подготовьте миски для воды и еды по размеру питомца,\n" +
            Emoji.CHECK_MARK + " Подготовьте 1-2 игрушки, можно что-то из них подвесить для развлечения кота,\n" +
            Emoji.CHECK_MARK + " Обязательно уделяйте время коту ежедневно и приучайте к ласковым поглаживаниям, если" +
            " животное не возражает, в противном случае, дайте ему время привыкнуть к вам,\n" +
            Emoji.CHECK_MARK + " Если в доме есть другие животные, продумайте варианты их временной изоляции,\n" +
            Emoji.CHECK_MARK + " Уберите с пола и с легкодоступных (даже высоких) поверхностей все мелкие и бьющиеся предметы и обувь.\n");

    public static final String PLACE_FOR_DISABLED_DOG = EmojiParser.parseToUnicode(Emoji.DOG +
            "Как приспособить дом для особенной собаки:\n" +
            Emoji.CHECK_MARK + " Заранее определите все возможные легкодоступные варианты мест для собаки,\n" +
            Emoji.CHECK_MARK + " Подготовьте подстилку (если считаете нужным), чтобы она была обозначением места собаки,\n" +
            Emoji.CHECK_MARK + " Подготовьте миски для воды и еды по размеру питомца (можно на стойке),\n" +
            Emoji.CHECK_MARK + " Подготовьте 1-2 резиновые игрушки для развлечения собаки,\n" +
            Emoji.CHECK_MARK + " Желательно приобрести лакомства для поощрения и тренировок с собакой,\n" +
            Emoji.CHECK_MARK + " Если в доме есть другие животные, продумайте варианты их временной изоляции от собаки,\n" +
            Emoji.CHECK_MARK + " Уберите с пола и с легкодоступных поверхностей все мелкие предметы и обувь.\n\n" +
            "Животное без зрения:\n" +
            Emoji.CHECK_MARK + " Помогите питомцу сориентироваться, проведите ему экскурсию,\n" +
            Emoji.CHECK_MARK + " Постарайтесь освободить проходы, чтобы животное не врезалось случайно,\n" +
            Emoji.CHECK_MARK + " Постарайтесь поселить собаку рядом с собой, чтобы животное легче адаптировалось к новым" +
            " условиям, а вы могли быстро реагировать на его запросы.\n\n" +
            "Питомец с проблемами передвижения:\n" +
            Emoji.CHECK_MARK + " Определите место кормления поблизости от лежанки питомца,\n" +
            Emoji.CHECK_MARK + " Постарайтесь позаботиться о лёгком выходе собаки на улицу и входе в дом,\n" +
            Emoji.CHECK_MARK + " Не жалейте и не балуйте излишне питомца.\n");

    public static final String PLACE_FOR_DISABLED_CAT = EmojiParser.parseToUnicode(Emoji.CAT +
            "Как приспособить дом для особенных котов:\n" +
            Emoji.CHECK_MARK + " Заранее определите несколько вариантов, возможных и легкодоступных мест для кота,\n" +
            Emoji.CHECK_MARK + " Закройте, заблокируйте все щели и углы, куда коту попадать не нужно,\n" +
            Emoji.CHECK_MARK + " Подготовьте лежанку, чтобы она была обозначением места для питомца,\n" +
            Emoji.CHECK_MARK + " Желательно позаботиться о когтеточке, чтобы кот не портил мебель,\n" +
            Emoji.CHECK_MARK + " Продумайте и подготовьте туалет и место для него,\n" +
            Emoji.CHECK_MARK + " Подготовьте миски для воды и еды по размеру питомца,\n" +
            Emoji.CHECK_MARK + " Подготовьте 1-2 игрушки, можно что-то из них подвесить для развлечения кота,\n" +
            Emoji.CHECK_MARK + " Обязательно уделяйте время коту ежедневно и приучайте к ласке, если животное не возражает," +
            " в противном случае, дайте ему время привыкнуть к вам,\n" +
            Emoji.CHECK_MARK + " Если в доме есть другие животные, продумайте варианты их временной изоляции,\n" +
            Emoji.CHECK_MARK + " Уберите с пола и с легкодоступных (даже высоких) поверхностей все мелкие и бьющиеся предметы и обувь.\n" +
            "Животное без зрения:\n" +
            Emoji.CHECK_MARK + " Помогите питомцу сориентироваться, проведите ему экскурсию,\n" +
            Emoji.CHECK_MARK + " Постарайтесь освободить проходы, чтобы животное не врезалось случайно,\n" +
            Emoji.CHECK_MARK + " Постарайтесь устроить котика рядом с собой, чтобы животное легче адаптировалось к новым" +
            " условиям, а вы могли быстро реагировать на его запросы.\n\n" +
            "Питомец с проблемами передвижения:\n" +
            Emoji.CHECK_MARK + " Определите место кормления максимально близко от выбранной котом лежанки,\n" +
            Emoji.CHECK_MARK + " Постарайтесь позаботиться о туалет расположите в удобном и легкодоступном месте,\n" +
            Emoji.CHECK_MARK + " Не жалейте и не балуйте излишне питомца.\n");

    public static final String CYNOLOGIST_ADVISES = EmojiParser.parseToUnicode(Emoji.FOLDED_HANDS +
            "Советы кинолога:\n" +
            Emoji.CHECK_MARK + " Помните, что вы - хозяин, собака не должна вами манипулировать и управлять!\n" +
            Emoji.CHECK_MARK + " Обязательно запланируйте ежедневное время на прогулку не менее 2 часов, разделяя время на утро и вечер, по необходимости и на дневные часы,\n" +
            Emoji.CHECK_MARK + " Первое время не отпускайте собаку с поводка на прогулке, пусть питомец к вам привыкнет,\n" +
            Emoji.CHECK_MARK + " Выбирая амуницию для прогулок, учитывайте вес и активность своего питомца,\n" +
            Emoji.CHECK_MARK + " Собака не должна голодать или переедать,\n" +
            Emoji.CHECK_MARK + " Взрослую собаку нужно кормить дважды в день сухим кормом или приготовленной для собаки едой,\n" +
            Emoji.CHECK_MARK + " Уделяйте время собаке помимо прогулки, разговаривайте, играйте, занимайтесь с ней,\n" +
            Emoji.CHECK_MARK + " Добивайтесь бесприкословного выполнения ваших команд,\n" +
            Emoji.CHECK_MARK + " Наказывайте животное только в случае неповиновения непосредственно при совершении проступка, чтобы питомец понимал, за что наказывают,\n" +
            Emoji.CHECK_MARK + " Старайтесь не наказывать рукой, крик тоже не помогает, старайтесь, чтобы наказывал посторонний предмет, например, швабра сама и упала на собаку и т.п.,\n" +
            Emoji.CHECK_MARK + " Правила жизни собаки должны быть неизменными, их можно корректировать, но не часто и не кардинально,\n" +
            Emoji.CHECK_MARK + " Читайте литературу о собаках и об их мировосприятии, чтобы понимать питомца лучше,\n" +
            Emoji.CHECK_MARK + " Если не знаете, как справляться с поведенческими проблемами, обращайтесь к специалистам.\n");
    public static final String LIST_OF_CYNOLOGISTS = EmojiParser.parseToUnicode(Emoji.CALL_ME_HAND +
            "Кинологи, готовые помочь индивидуально:\n" +
            Emoji.CHECK_MARK + " Иван Михайлов, 780-ххх-хх-хх\n" +
            Emoji.CHECK_MARK + " Марина Соркина, 780-ххх-хх-хх\n" +
            Emoji.CHECK_MARK + " Катя Липай, 780-ххх-хх-хх\n" +
            Emoji.CHECK_MARK + " Михаил Занин, 780-ххх-хх-хх\n");
    public static final String ADOPTING_DENY_REASONS = EmojiParser.parseToUnicode(Emoji.ANGUISHED_FACE +
            "Причины отказа в усыновлении животного:\n" +
            Emoji.CHECK_MARK + " Усыновитель не предоставил все указанные документы,\n" +
            Emoji.CHECK_MARK + " Усыновитель не может подготовить/оборудовать дом для питомца,\n" +
            Emoji.CHECK_MARK + " Усыновитель отказывается отправлять ежедневные отчёты о питомце по любым причинам,\n" +
            Emoji.CHECK_MARK + " Усыновитель явно употребляет алкоголь и/или другие транквилизаторы.\n" +
            Emoji.CHECK_MARK + " Волонтёры отмечают любые неадекватные проявления в отношении животных.\n");
}
